// search index for WYSIWYG Web Builder
var database_length = 0;

function SearchPage(url, title, keywords, description)
{
   this.url = url;
   this.title = title;
   this.keywords = keywords;
   this.description = description;
   return this;
}

function SearchDatabase()
{
   database_length = 0;
   this[database_length++] = new SearchPage("index.html", "Україна і світ. 5 клас", " ІНТЕРАКТИВНИЙ ЕЛЕКТРОННИЙ ДОДАТОК   Цей електронний додаток створений для того, щоб навчання перетворилося на справжнє дослідження Тут немає нудних текстів — лише те, що надихає!  Що на вас чекає  Інфографіка уроку  вся інформація стисло та інформативно Медіатека  переглядайте відеоуроки та інші цікаві відео, слухайте подкасти Інтерактивні вправи  закріплюйте знання через ігри Україна — це частина великого і різноманітного світу, і нам є чим пишатися!    © 2026 ТОВ \"Генеза\"   ", "");
   this[database_length++] = new SearchPage("p1.html", "Україна і світ. 5 клас", "Вступ  Розділ 1 Дослідження історії   ", "");
   this[database_length++] = new SearchPage("p2.html", "Україна і світ. 5 клас", "ВСТУП § 1 Що таке історія?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p3.html", "Україна і світ. 5 клас", "Розділ 1 ДОСЛІДЖЕННЯ ІСТОРІЇ §2 Що вивчають історики?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p4.html", "Україна і світ. 5 клас", "§ 3 Як рахують час в історії?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("pro.html", "Україна і світ. 5 клас", "                                                           Про інтерактивний електронний додаток  Цей е-додаток створено для того, щоб урізноманітнити навчання за підручником, зробити його ефективнішим і цікавішим Контент подано за розділами та параграфами відповідно до змісту підручника   Тут ви можете   ознайомитися з текстом підручника  стисло зрозуміти матеріал уроку за допомогою інфографіки параграфа  переглянути навчальні відео, отримати додаткову цікаву інформацію  перевірити свої знання за допомогою інтерактивних вправ  Системні вимоги Операційна система — Windows 7 чи пізніші версії, Linux, ChromeOS, macOS, Android, iOS Оперативна пам’ять — 4 ГБ і більше Web browser — усі, що підтримують HTML5 Місце на жорсткому диску  для роботи офлайн  — 2 ГБ і більше  Uicons Flaticon   ", "");
   this[database_length++] = new SearchPage("p2p2.html", "Україна і світ. 5 клас", "Розгадай ребус і витлумач зашифроване слово   ", "");
   this[database_length++] = new SearchPage("p3p3.html", "Україна і світ. 5 клас", "Зберіть пазл і ви дізнаєтесь, яка людина поклала початок історичній науці   ", "");
   this[database_length++] = new SearchPage("p4p4.html", "Україна і світ. 5 клас", "Розглянь хмару слів Яке слово є найбільшим? Поясни, чому саме воно є ключовим для цієї теми   ", "");
   this[database_length++] = new SearchPage("p5.html", "Україна і світ. 5 клас", "§ 4 Як орієнтуватися в подіях минулого?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p6.html", "Україна і світ. 5 клас", "§ 5 Що таке географічний та історичний простір?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p7.html", "Україна і світ. 5 клас", "§ 6 Що таке історичне джерело?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p8.html", "Україна і світ. 5 клас", "§ 7 Які науки допомагають досліджувати минуле?  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   this[database_length++] = new SearchPage("p9.html", "Україна і світ. 5 клас", "§ 8 Рефлексія теми Проєктна діяльність  ІНТЕРАКТИВНІ ВПРАВИ  НАЙВАЖЛИВІШЕ    ", "");
   return this;
}
